package com.school.DataBase;

import java.util.Random;

public class GetRandomName {
    private static String[] names = {
            "Адам", "Вадим", "Евгений", "Никита",
            "Адольф", "Валентин", "Евдоким", "Николай",
            "Александр", "Валерий", "Егор", "Олег",
            "Алексей", "Василий", "Ефим", "Павел",
            "Анатолий", "Виктор", "Захар", "Петр",
            "Андрей", "Виталий", "Иван",
            "Прохор",
            "Антон", "Владимир", "Игорь", "Роман",
            "Аристарх", "Владислав", "Илья", "Руслан",
            "Аркадий", "Всеволод", "Иннокентий", "Семен",
            "Арсен", "Вячеслав", "Карл", "Сергей",
            "Артем", "Гавриил", "Кирилл",
            "Станислав",
            "Артур", "Геннадий", "Клим", "Степан",
            "Афанасий", "Георгий", "Константин", "Тарас",
            "Богдан", "Герман", "Лев", "Тимур",
            "Борис",
            "Глеб", "Леонид", "Федор",
            "Бронислав", "Григорий", "Леонтий", "Филипп",
            "Давид", "Макар",
            "Эдуард",
            "Даниил", "Максим", "Юрий",
            "Денис", "Мартин", "Яков",
            "Дмитрий", "Михаил",
            "Аврора", "Валентина", "Карина", "Полина",
            "Агнесса", "Валерия", "Кира", "Раиса",
            "Агния", "Варвара", "Клавдия", "Регина",
            "Ада", "Венера", "Клара", "Римма",
            "Алевтина", "Вера", "Кристина", "Роза",
            "Александра", "Вероника", "Лариса", "Роксана",
            "Алина", "Виктория", "Лидия", "Светлана",
            "Алиса", "Виолетта", "Лилия", "Серафима",
            "Алла", "Галина", "Любовь", "Софья",
            "Альбина", "Гелла", "Людмила", "Стелла",
            "Анастасия", "Дарья", "Майя", "Сусанна",
            "Ангелина", "Диана", "Маргарита", "Тамара",
            "Анжелика", "Ева", "Мария", "Татьяна",
            "Анна", "Евгения", "Марина", "Фаина",
            "Антонина", "Екатерина", "Марта", "Элеонора",
            "Анфиса", "Елена", "Милена", "Эльвира",
            "Астра", "Елизавета", "Надежда", "Эльза",
            "Белла", "Жанна", "Наталья", "Эмма",
            "Берта", "Зинаида", "Нелли", "Юлия",
            "Бета ,Иветта", "Зоя", "Нина", "Юнона",
            "Инна", "Оксана", "Яна",
            "Ирина", "Олеся"
    };

    public static String firstName() {
        Random random = new Random();
        int n = random.nextInt(names.length - 1);
        return names[n];
    }
}
